# TrussFamilyBottomChordEndReleaseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyBottomChordEndReleaseType Property
ParameterTypeId Class See Also
---
"End Release"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyBottomChordEndReleaseType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyBottomChordEndReleaseType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyBottomChordEndReleaseType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace